app/controllers/api/registrations_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `created_at`, `updated_at`, `token`) VALUES ('maciek@gmail.com', '$2a$12$qW0ZlhDHuUvcAOhHpRBx8eUTrsYxzvFaPqe0AEkbaTrLCGqDCrZhi', NULL, NULL, NULL, '2025-04-22 15:31:12.614095', '2025-04-22 15:31:12.614095', NULL)
---
  def create
    user = User.new(user_params)
    if user.save