app/controllers/api/sessions_controller.rb

  def login
    user = User.find_by(email: login_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'maciek@gmail.com' LIMIT 1

  def logout
    user = User.find_by(token: request.headers['Authorization'].split(' ').last)

    if user
      user.update(token: nil)
---
SELECT `users`.* FROM `users` WHERE `users`.`token` = 'eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoxLCJleHAiOjE3NDU0MjMxODZ9.CSLDDGuIJrCvPiqy8oyv25yYNyLHAcGYfqc2KJjEsi4' LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2025-04-22 15:49:14.665963', `users`.`token` = NULL WHERE `users`.`id` = 1