app/controllers/api/users_controller.rb

  def index
    users = User.all
---
SELECT `users`.* FROM `users`

  def set_user
    @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1