app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def authenticate_user!
    token = request.headers['Authorization'].to_s.split(' ').last
    decoded = JWT.decode(token, Rails.application.secret_key_base)[0]
    user = User.find(decoded['user_id'])